app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index

    if params[:artist_id]

      if @artist = Artist.find_by(id: params[:artist_id])

        @songs = @artist.songs
        render :index
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end

    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE (5) LIMIT 1
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE (12345) LIMIT 1
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 7]]
---
  def show

    @song = Song.find_by(id: params[:id])

    if params[:artist_id]

      if @artist = Artist.find_by(params[:artist_id])
        if @song
          if @artist.songs.include?(@song)